zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_dcmipp.h
/**
  ******************************************************************************
  * @file    stm32mp13xx_hal_dcmipp.h
  * @author  MCD Application Team
  * @brief   Header file of DCMIPP HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP13xx_HAL_DCMIPP_H
#define __STM32MP13xx_HAL_DCMIPP_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_hal_def.h"

/** @addtogroup STM32MP13xx_HAL_Driver
  * @{
  */

#if defined (DCMIPP)

/** @addtogroup DCMIPP DCMIPP
  * @brief DCMIPP HAL module driver
  * @{
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup DCMIPP_Exported_Types DCMIPP Exported Types
  * @brief    DCMIPP Exported Types
  * @{
  */
/**
  * @brief   DCMIPP Embedded Synchronisation Unmask codes structure definition
  */
typedef struct
{
  uint8_t FrameStartUnmask; /*!< Specifies the frame start delimiter unmask. */
  uint8_t LineStartUnmask;  /*!< Specifies the line start delimiter unmask.  */
  uint8_t LineEndUnmask;    /*!< Specifies the line end delimiter unmask.    */
  uint8_t FrameEndUnmask;   /*!< Specifies the frame end delimiter unmask.   */
} DCMIPP_EmbeddedSyncUnmaskTypeDef;

/**
  * @brief   DCMIPP Embedded Synchronisation codes structure definition (CCIR656)
  */
typedef struct
{
  uint8_t FrameStartCode;  /*!< Specifies the code of the frame start delimiter. */
  uint8_t LineStartCode;   /*!< Specifies the code of the line start delimiter.  */
  uint8_t LineEndCode;     /*!< Specifies the code of the line end delimiter.    */
  uint8_t FrameEndCode;    /*!< Specifies the code of the frame end delimiter.   */
} DCMIPP_EmbeddedSyncCodesTypeDef;


/**
  * @brief  HAL DCMIPP Parallel configuration structure definition
  */
typedef struct
{
  uint32_t  Format;                             /*!< Configures the DCMIPP Format
                                                  This parameter can be one value of @ref DCMIPP_Format              */
  uint32_t  VSPolarity;                         /*!< Specifies the Vertical synchronization polarity: High or Low.
                                                  This parameter can be a value of @ref DCMIPP_VSYNC_Polarity        */
  uint32_t  HSPolarity;                         /*!< Specifies the Horizontal synchronization polarity: High or Low.
                                                  This parameter can be a value of @ref DCMIPP_HSYNC_Polarity        */
  uint32_t  PCKPolarity;                        /*!< Specifies the Pixel clock polarity: Falling or Rising.
                                                  This parameter can be a value of @ref DCMIPP_PIXCK_Polarity        */
  uint32_t  ExtendedDataMode ;                  /*!< Specifies the data width: 8-bit, 10-bit, 12-bit 14-bit or 16-bits.
                                                  This parameter can be a value of @ref DCMIPP_Extended_Data_Mode    */
  uint32_t  SynchroMode;                        /*!< Specifies the Synchronization Mode: Hardware or Embedded.
                                                  This parameter can be a value of @ref DCMIPP_Synchronization_Mode  */
  DCMIPP_EmbeddedSyncCodesTypeDef SynchroCodes; /*!< Specifies the code of the line/frame start delimiter and the
                                                  line/frame end delimiter                                           */
  uint32_t  SwapBits;                           /*!< Enable or Disable the Swap Bits.
                                                  This parameter can be a value of @ref DCMIPP_SWAP_BITS             */
  uint32_t  SwapCycles;                         /*!<  Enable or Disable the Swap Cycles.
                                                  This parameter can be a value of @ref DCMIPP_SWAP_CYCLES           */
} DCMIPP_ParallelConfTypeDef;

/**
  * @brief  HAL DCMIPP Pipe configuration structure definition
  */
typedef struct
{
  uint32_t FrameRate;         /*!< Configures the DCMIPP Pipe Frame Rate
                                   This parameter can be one value of @ref DCMIPP_Frame_Rates      */
} DCMIPP_PipeConfTypeDef;

/**
  * @brief  HAL DCMIPP IPPLUG configuration structure definition
  */
typedef struct
{
  uint32_t Client;                      /*!< Configures the DCMIPP IPPLUG Client
                                             This parameter can be a value from @ref DCMIPP_IPPLUG_Client      */
  uint32_t MemoryPageSize;              /*!< Configures the DCMIPP IPPLUG Memory page size
                                             This parameter can be a value from @ref DCMIPP_Memory_Page_Size   */
  uint32_t Traffic;                     /*!< Configures the DCMIPP IPPLUG Traffic
                                             This parameter can be a value from @ref DCMIPP_Traffic_Burst_Size */
  uint32_t MaxOutstandingTransactions ; /*!< Configures the DCMIPP IPPLUG Maximum outstanding transactions
                                             This parameter can be a value from
                                             DCMIPP_Maximum_Outstanding_Transactions                           */
  uint32_t DPREGStart;                  /*!< Configures the End word of the FIFO of Clientx
                                             This parameter can be a value between 0 and  0x3FF                */
  uint32_t DPREGEnd;                    /*!< Configures the Start word of the FIFO of Clientx
                                             This parameter can be a value between 0 and  0x3FF                */
  uint32_t WLRURatio;                   /*!< Configures the DCMIPP Ratio for WLRU arbitration
                                             This parameter can be a value between 0 and 15                    */
} DCMIPP_IPPlugConfTypeDef;

/**
  * @brief  HAL DCMIPP Crop configuration structure definition
  */
typedef struct
{
  uint32_t VStart;   /*!< Configures the DCMIPP Crop Vertical Start
                          This parameter can be one value between 0 and 0xFFF          */
  uint32_t HStart;   /*!< Configures the DCMIPP Crop Horizontal Start
                          This parameter can be one value between 0 and 0xFFF          */
  uint32_t VSize;    /*!< Configures the DCMIPP Crop Vertical Size
                          This parameter can be one value between 0 and 0xFFF          */
  uint32_t HSize;    /*!< Configures the DCMIPP Crop Horizontal Size
                          This parameter can be one value between 1 and 0xFFF          */
  uint32_t PipeArea; /*!< Configures the DCMIPP Crop Area for the pipe0
                          This parameter can be one value of @ref DCMIPP_Crop_Area     */
} DCMIPP_CropConfTypeDef;


/**
  * @brief  HAL DCMIPP State enumeration definition
  */
typedef enum
{
  HAL_DCMIPP_STATE_RESET = 0x00U,  /*!< DCMIPP not yet initialized or disabled  */
  HAL_DCMIPP_STATE_INIT  = 0x01U,  /*!< DCMIPP initialized                      */
  HAL_DCMIPP_STATE_READY = 0x02U,  /*!< DCMIPP configured and ready for use     */
  HAL_DCMIPP_STATE_BUSY  = 0x03U,  /*!< DCMIPP internal processing is ongoing   */
  HAL_DCMIPP_STATE_ERROR = 0x04U,  /*!< DCMIPP state error                      */
} HAL_DCMIPP_StateTypeDef;

/**
  * @brief  HAL DCMIPP Pipe State enumeration definition
  */

